@gruizonestic 

Oh interesting.

So I just tried with a new project...

```tf
terraform {
  required_providers {
    fastly = {
      source  = "fastly/fastly"
      version = "5.1.0"
    }
  }
}

resource "fastly_service_vcl" "demo" {
  name = "testing-fastly-tf-prod-enablement-bug"

  domain {
    name = "testing-fastly-tf-prod-enablement-bug.integralist.co.uk"
  }

  backend {
    address = "127.0.0.1"
    name    = "localhost"
    port    = 80
    shield  = "amsterdam-nl"
  }

  product_enablement {
    image_optimizer = true
  }

  force_destroy = true
}
```

And this applied fine for me...

```
$ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fastly_service_vcl.demo will be created
  + resource "fastly_service_vcl" "demo" {
      + activate           = true
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_destroy      = true
      + force_refresh      = (known after apply)
      + http3              = false
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "testing-fastly-tf-prod-enablement-bug"
      + stale_if_error     = false
      + stale_if_error_ttl = 43200

      + backend {
          + address               = "127.0.0.1"
          + auto_loadbalance      = false
          + between_bytes_timeout = 10000
          + connect_timeout       = 1000
          + error_threshold       = 0
          + first_byte_timeout    = 15000
          + max_conn              = 200
          + name                  = "localhost"
          + port                  = 80
          + shield                = "amsterdam-nl"
          + ssl_check_cert        = true
          + use_ssl               = false
          + weight                = 100
        }

      + domain {
          + name = "testing-fastly-tf-prod-enablement-bug.integralist.co.uk"
        }

      + product_enablement {
          + brotli_compression = false
          + domain_inspector   = false
          + image_optimizer    = true
          + name               = (known after apply)
          + origin_inspector   = false
          + websockets         = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
fastly_service_vcl.demo: Creating...
fastly_service_vcl.demo: Creation complete after 7s [id=blgln4pflDDIwMDDjC0xe6]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Then running a second plan to check all is fine:

```
$ terraform plan

fastly_service_vcl.demo: Refreshing state... [id=blgln4pflDDIwMDDjC0xe6]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```